       ADD-MODE.
            MOVE "ADD" TO THE-MODE.
            PERFORM GET-NEW-VENDOR-NUMBER.
            PERFORM ADD-RECORDS
               UNTIL VENDOR-NUMBER = ZEROES.

       GET-NEW-VENDOR-NUMBER.
            PERFORM ACCEPT-NEW-RECORD-KEY.
            PERFORM RE-ACCEPT-NEW-RECORD-KEY
               UNTIL VENDOR-RECORD-FOUND = "N" OR
                   VENDOR-NUMBER = ZEROES.

       ACCEPT-NEW-RECORD-KEY.
            PERFORM INIT-VENDOR-RECORD.
            PERFORM ENTER-VENDOR-NUMBER.
            IF VENDOR-NUMBER NOT = ZEROES
                PERFORM READ-VENDOR-RECORD.

       RE-ACCEPT-NEW-RECORD-KEY.
            DISPLAY "RECORD ALREADY ON FILE".
            PERFORM ACCEPT-NEW-RECORD-KEY.


       ADD-RECORDS.
            PERFORM ENTER-REMAINING-FIELDS.
            PERFORM WRITE-VENDOR-RECORD.
            PERFORM GET-NEW-RECORD-KEY.

       ENTER-REMAINING-FIELDS.
            PERFORM ENTER-VENDOR-NAME.
            PERFORM ENTER-VENDOR-ADDRESS-1.
            PERFORM ENTER-VENDOR-ADDRESS-2.
            PERFORM ENTER-VENDOR-CITY.
            PERFORM ENTER-VENDOR-STATE.
            PERFORM ENTER-VENDOR-ZIP.
            PERFORM ENTER-VENDOR-CONTACT.
            PERFORM ENTER-VENDOR-PHONE.
