       ADD-MODE.
            MOVE "ADD" TO THE-MODE.
            PERFORM GET-NEW-VENDOR-NUMBER.
            PERFORM ADD-RECORDS
               UNTIL VENDOR-NUMBER = ZEROES.

       GET-NEW-VENDOR-NUMBER.
            PERFORM INIT-VENDOR-RECORD.
            PERFORM ENTER-VENDOR-NUMBER.
            MOVE "Y" TO RECORD-FOUND.
            PERFORM FIND-NEW-VENDOR-RECORD
               UNTIL RECORD-FOUND = "N" OR
                     VENDOR-NUMBER = ZEROES.

       FIND-NEW-VENDOR-RECORD.
            PERFORM READ-VENDOR-RECORD.
            IF RECORD-FOUND = "Y"
                DISPLAY "RECORD ALLREADY ON FILE".
                PERFORM ENTER-VENDOR-NUMBER.

       ADD-RECORDS.
            PERFORM ENTER-REMAINING-FIELDS.
            PERFORM WRITE-VENDOR-RECORD.
            PERFORM GET-NEW-VENDOR-NUMBER.

       ENTER-REMAINING-FIELDS.
            PERFORM ENTER-VENDOR-NAME.
            PERFORM ENTER-VENDOR-ADDRESS-1.
            PERFORM ENTER-VENDOR-ADDRESS-2.
            PERFORM ENTER-VENDOR-CITY.
            PERFORM ENTER-VENDOR-STATE.
            PERFORM ENTER-VENDOR-ZIP.
            PERFORM ENTER-VENDOR-CONTACT.
            PERFORM ENTER-VENDOR-PHONE.
