       FIND-VENDOR-RECORD.
            PERFORM READ-VENDOR-RECORD.
            IF RECORD-FOUND = "N"
                DISPLAY "RECORD NOT FOUND".
                PERFORM ENTER-VENDOR-NUMBER.

       ENTER-VENDOR-NAME.
            DISPLAY "ENTER VENDOR NAME".
            ACCEPT VENDOR-NAME.

       ENTER-VENDOR-ADDRESS-1.
            DISPLAY "ENTER VENDOR ADDRESS-1".
            ACCEPT VENDOR-ADDRESS-1.

       ENTER-VENDOR-ADDRESS-2.
            DISPLAY "ENTER VENDOR ADDRESS-2".
            ACCEPT VENDOR-ADDRESS-2.

       ENTER-VENDOR-CITY.
            DISPLAY "ENTER VENDOR CITY".
            ACCEPT VENDOR-CITY.

       ENTER-VENDOR-STATE.
            DISPLAY "ENTER VENDOR STATE".
            ACCEPT VENDOR-STATE.

       ENTER-VENDOR-ZIP.
            DISPLAY "ENTER VENDOR ZIP".
            ACCEPT VENDOR-ZIP.

       ENTER-VENDOR-CONTACT.
            DISPLAY "ENTER VENDOR CONTACT".
            ACCEPT VENDOR-CONTACT.

       ENTER-VENDOR-PHONE.
            DISPLAY "ENTER VENDOR PHONE".
            ACCEPT VENDOR-PHONE.
