       FIND-VENDOR-RECORD.
            PERFORM READ-VENDOR-RECORD.
            IF RECORD-FOUND = "N"
                DISPLAY "RECORD NOT FOUND".
                PERFORM ENTER-VENDOR-NUMBER.

       ENTER-VENDOR-NAME.
            PERFORM ACCEPT-VENDOR-NAME.
            PERFORM RE-ACCEPT-VENDOR-NAME
               UNTIL VENDOR-NAME NOT = SPACE.

       ACCEPT-VENDOR-NAME.
            DISPLAY "ENTER VENDOR NAME".
            ACCEPT VENDOR-NAME.
            INSPECT VENDOR-NAME
               CONVERTING LOWER-ALPHA
               TO UPPER-ALPHA.

       ENTER-VENDOR-ADDRESS-1.
            PERFORM ACCEPT-VENDOR-ADDRESS-1.
            PERFORM RE-ACCEPT-VENDOR-ADDRESS-1
               UNTIL VENDOR-ADDRESS-1 NOT = SPACE.

       RE-ACCEPT-VENDOR-ADDRESS-1.
            DISPLAY "VENDOR NAME MUST BE ENTERED".
            PERFORM ACCEPT-VENDOR-NAME.

       ACCEPT-VENDOR-ADDRESS-1.
            DISPLAY "ENTER VENDOR ADDRESS-1".
            ACCEPT VENDOR-ADDRESS-1.
            INSPECT VENDOR-ADDRESS-1
               CONVERTING LOWER-ALPHA
               TO UPPER-ALPHA.

       RE-ACCEPT-VENDOR-ADDRESS-1.
            DISPLAY "VENDOR ADDRESS-1 MUST BE ENTERED".
            PERFORM ACCEPT-VENDOR-ADDRESS-1.

       ENTER-VENDOR-ADDRESS-2.
            DISPLAY "ENTER VENDOR ADDRESS-2".
            ACCEPT VENDOR-ADDRESS-2.
            INSPECT VENDOR-ADDRESS-2
               CONVERTING LOWER-ALPHA
               TO UPPER-ALPHA.

       ENTER-VENDOR-CITY.
            PERFORM ACCEPT-VENDOR-CITY.
            PERFORM RE-ACCEPT-VENDOR-CITY
               UNTIL VENDOR-CITY NOT = SPACE.

       ACCEPT-VENDOR-CITY.
            DISPLAY "ENTER VENDOR CITY".
            ACCEPT VENDOR-CITY.
            INSPECT VENDOR-CITY
               CONVERTING LOWER-ALPHA
               TO UPPER-ALPHA.

       RE-ACCEPT-VENDOR-CITY.
            DISPLAY "VENDOR CITY MUST BE ENTERED".
            PERFORM ACCEPT-VENDOR-CITY.

       ENTER-VENDOR-STATE.
            PERFORM ACCEPT-VENDOR-STATE.
            PERFORM RE-ACCEPT-VENDOR-STATE
               UNTIL VENDOR-STATE NOT = SPACE.

       ACCEPT-VENDOR-STATE.
            DISPLAY "ENTER VENDOR STATE".
            ACCEPT VENDOR-STATE.
            PERFORM EDIT-CHECK-VENDOR-STATE.

       RE-ACCEPT-VENDOR-STATE.
            DISPLAY ERROR-MESSAGE.
            PERFORM ACCEPT-VENDOR-STATE.

       EDIT-CHECK-VENDOR-STATE.
            PERFORM EDIT-VENDOR-STATE.
            PERFORM CHECK-VENDOR-STATE.

       EDIT-VENDOR-STATE.
            INSPECT VENDOR-STATE
               CONVERTING LOWER-ALPHA
               TO UPPER-ALPHA.

       CHECK-VENDOR-STATE.
            PERFORM VENDOR-STATE-REQUIRED.
            IF VENDOR-STATE NOT = SPACES
                PERFORM VENDOR-STATE-ON-FILE.

       VENDOR-STATE-REQUIRED.
            IF VENDOR-STATE = SPACE
                MOVE "VENDOR STATE MUST BE ENTERED"
                   TO ERROR-MESSAGE.

       VENDOR-STATE-ON-FILE.
            MOVE VENDOR-STATE TO STATE-CODE.
            PERFORM READ-STATE-RECORD.
            IF STATE-RECORD-FOUND = "N"
                MOVE "STATE CODE NOT FOUND IN CODES FILE"
                   TO ERROR-MESSAGE.

       ENTER-VENDOR-ZIP.
            PERFORM ACCEPT-VENDOR-ZIP.
            PERFORM RE-ACCEPT-VENDOR-ZIP
               UNTIL VENDOR-ZIP NOT = SPACE.

       ACCEPT-VENDOR-ZIP.
            DISPLAY "ENTER VENDOR ZIP".
            ACCEPT VENDOR-ZIP.
            INSPECT VENDOR-ZIP
               CONVERTING LOWER-ALPHA
                   TO UPPER-ALPHA.

       RE-ACCEPT-VENDOR-ZIP.
            DISPLAY "VENDOR ZIP MUST BE ENTERED".
            PERFORM ACCEPT-VENDOR-ZIP.

       ENTER-VENDOR-CONTACT.
            DISPLAY "ENTER VENDOR CONTACT".
            ACCEPT VENDOR-CONTACT.
            INSPECT VENDOR-CONTACT
               CONVERTING LOWER-ALPHA
                   TO UPPER-ALPHA.

       ENTER-VENDOR-PHONE.
            PERFORM ACCEPT-VENDOR-PHONE.
            PERFORM RE-ACCEPT-VENDOR-PHONE
               UNTIL VENDOR-PHONE NOT = SPACE.

       ACCEPT-VENDOR-PHONE.
            DISPLAY "ENTER VENDOR PHONE".
            ACCEPT VENDOR-PHONE.
            INSPECT VENDOR-PHONE
               CONVERTING LOWER-ALPHA
                   TO UPPER-ALPHA.
