      ******************************************************************
      * Author: Felix Eisenmenger
      * Date:
      * Purpose: Training
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
            DISPLAY "Hello, world!".
       PROGRAM-DONE.
            STOP RUN.
