      ******************************************************************
      * Author: Felix Eisenmenger
      * Date:
      * Purpose: training
      * Tectonics: cobc
      ******************************************************************
       fd   control-file
            label records are standard.

       01   control-record.
            05 control-key                 pic 9.
            05 control-last-voucher        pic 9(5).
